# Примечание: в текущей версии проекта код обрабатывает только две методики - шкалу перфекционизма Хьюита-Флита и опросник временной перспективы Зимбардо

import csv
from pathlib import Path

# number - номер испытуемого; остальные списки ниже будут содержать соответствующие им шкалы из опросников.
FEEDBACK_TEXT = [
    {
        'survey_name': 'Первая методика: Многомерная шкала перфекционизма Хьюита-Флита.',
        'scales': [
            {
                'column': 1,
                'name_of_scale': 'Шкала 1: Я-ориентированный перфекционизм.',
                'low_level': 49,
                'high_level': 83,
                'text': [
                    'Вам не свойственно предъявлять к себе завышенные требования и стремиться их реализовать любой ценой.',
                    'В некоторых сферах жизни Вы предъявляете к себе завышенные требования, которые стремитесь воплотить.',
                    'Вы во всех сферах жизни предъявляете завышенные требования к себе и стремитесь их воплотить.'
                ]
            },
            {
                'column': 2,
                'name_of_scale': 'Шкала 2: Перфекционизм, ориентированный на других.',
                'low_level': 43,
                'high_level': 68,
                'text': [
                    'Вы не предъявляете чрезвычайно высокие требования к окружающим людям.',
                    'Вы иногда предъявляете чрезвычайно высокие требования к окружающим людям.',
                    'Вы зачастую предъявляете чрезвычайно высокие требования к окружающим людям.'
                ]
            },
            {
                'column': 3,
                'name_of_scale': 'Шкала 3: Социально предписываемый перфекционизм.',
                'low_level': 35,
                'high_level': 65,
                'text': [
                    'Вы не расцениваете требования, предъявляемые к Вам окружающими, как завышенные и нереалистичные.',
                    'Вы периодически расцениваете требования, предъявляемые к Вам окружающими, как завышенные и нереалистичные.',
                    'Вы расцениваете требования, предъявляемые к Вам окружающими, как завышенные и нереалистичные.'
                ]
            },
            {
                'column': 4,
                'name_of_scale': 'Общий уровень перфекционизма.',
                'low_level': 160,
                'high_level': 204,
                'text': [' выраженности перфекционизма.'] * 3
            }
        ]
    },
    {
        'survey_name': 'Вторая методика: Опросник временной перспективы Зимбардо.',
        'scales': [
            {
                'column': 5,
                'name_of_scale': 'Шкала 1: Негативное прошлое.',
                'low_level': 2.55,
                'high_level': 3.62,
                'text': [
                    'Вы не относитесь к своему прошлому пессимистично, для Вас прошлое не является травматичным или неприятным.',
                    'Вы отчасти относитесь к своему прошлому пессимистично, некоторые произошедшие с Вами события Вы воспринимаете как травматические и неприятные. Также Вы иногда склонны сожалеть о поступках, совершенных Вами в прошлом.',
                    'Вы относитесь к своему прошлому пессимистично, воспринимаете его в значительной степени как травматичное и неприятное. Также Вы часто сожалеете о поступках, совершенных Вами в прошлом.'
                ]
            },
            {
                'column': 6,
                'name_of_scale': 'Шкала 2: Позитивное прошлое.',
                'low_level': 3.1,
                'high_level': 3.88,
                'text': [
                    'Вы не склонны воспринимать свое прошлое как теплое, не относитесь к нему с сентиментальностью. Вы редко обращаетесь к светлым моментам прошлого, так как воспоминания о них слабо поддерживают Вас в трудную минуту.',
                    'К некоторым событиям в своем прошлом Вы имеете теплое, сентиментальное отношение. Вы иногда обращаетесь к приятным и светлым моментам, воспоминания о которых поддерживают Вас в трудную минуту.',
                    'Вам свойственно теплое, сентиментальное отношение к прошлому. Для Вас прошлое - то, к чему очень приятно обращаться, ведь в нем хранится много приятных и светлых моментов, которые поддерживают Вас в трудную минуту.'
                ]
            },
            {
                'column': 7,
                'name_of_scale': 'Шкала 3: Фаталистическое настоящее.',
                'low_level': 2.39,
                'high_level': 3.25,
                'text': [
                    'Вы не считаете, что будущее предопределено и что Вы никак не можете на него повлиять. Вы часто предпринимаете шаги, действуете, ведь убеждены, что именно Ваши поступки определяют Вашу судьбу.',
                    'Иногда Вы чувствуете, что не способны повлиять на то, что происходит с Вами в настоящем. Периодически Вам кажется, что будущее предопределено и Вы никак не можете на него повлиять. Однако все же Вы действуете, когда считаете это возможным.',
                    'Вы часто чувствуете, что не способны повлиять на то, что происходит с Вами в настоящем. Вам кажется, что будущее предопределено и Вы никак не можете на него повлиять.'
                ]
            },
            {
                'column': 8,
                'name_of_scale': 'Шкала 4: Гедонистическое настоящее.',
                'low_level': 3.1,
                'high_level': 3.63,
                'text': [
                    'Вы не склонны ориентироваться на удовольствие и наслаждение, которое можете получить от нахождения в настоящем. Вам не нравится рисковать, поскольку не считаете, что яркие впечатления от риска стоят того.',
                    'Вы периодически ориентируетесь на получение удовольствия и наслаждения. Иногда Вам нравится рисковать, так как риск может приносить яркие впечатления. Бывают случаи, когда это приводит к игнорированию будущих последствий.',
                    'В настоящем Вы часто ориентируетесь на получение удовольствия и наслаждения. Вам нравится рисковать, ведь риск приносит Вам яркие впечатления. Также в моменте Вы склонны игнорировать будущие последствия.'
                ]
            },
            {
                'column': 9,
                'name_of_scale': 'Шкала 5: Будущее.',
                'low_level': 3.3,
                'high_level': 3.86,
                'text': [
                    'Ваше поведение редко определяется стремлениями к целям и вознаграждениям будущего. Вы не склонны планировать свою деятельность, часто она протекает импульсивно под влиянием того, что требуется в данный момент времени.',
                    'Ваше поведение периодически определяется стремлениями к целям и вознаграждениям будущего. Вы склонны планировать свою деятельность и способны иногда жертвовать чем-то в моменте для достижения цели в будущем.',
                    'Ваше поведение в большей степени определяется стремлениями к целям и вознаграждениям будущего. Вы умеете планировать свою деятельность и жертвовать чем-то в моменте для достижения цели в будущем. Также Вы часто ощущаете “давление времени” в текущей жизни.'
                ]
            }
        ]
    }
]

GREETING = 'Доброго времени суток! Вы участвовали в научном исследовании, посвященном перфекционизму. Этот файл содержит обратную связь: названия использованных методик, результаты в баллах и их интерпретацию. Спасибо за участие!'

NAME_OF_LEVEL = ['низкому', 'среднему', 'высокому']

RESULT_FOLDER = Path('results')


def define_level(score: float, low_level: float, high_level: float) -> int:
    """Определяет и кодирует уровень выраженности черты (0 - низкий, 1 - средний, 2 - высокий)"""
    if score < low_level:
        return 0
    elif score <= high_level:
        return 1
    else:
        return 2


def write_feedback(row: list[str]) -> str:
    """Составляет текст обратной связи на основе данных из строки"""
    lines = [GREETING]
    for survey in FEEDBACK_TEXT:
        lines.append('')
        lines.append(survey['survey_name'])
        for scale in survey['scales']:
            score = float(row[scale['column']])
            level = define_level(score, scale['low_level'], scale['high_level'])
            lines.append(scale['name_of_scale'])
            lines.append(f'Ваш балл: {score}. Это соответствует {NAME_OF_LEVEL[level]} уровню. {scale['text'][level]}')
    return '\n'.join(lines)


def write_in_files():
    """Открывает файлы и записывает в них результаты каждого испытуемого"""
    with open('points.csv',encoding='utf8',newline='') as f:
        rows = list(csv.reader(f))[1:]
        RESULT_FOLDER.mkdir(exist_ok = True)
    for row in rows:
        (RESULT_FOLDER / f'feedback_{row[0]}').write_text(write_feedback(row), encoding='utf8')
    print(f'Обработано {len(rows)} испытуемых, соответствующие файлы находятся в папке {RESULT_FOLDER}')

if __name__ == '__main__':
    write_in_files()

number = []
self_oriented = []
other_oriented = []
socially_prescribed = []
perf_overall = []
neg_past = []
pos_past = []
fat_pres = []
hed_pres = []
future = []

with open ("points.csv","r",encoding="utf8") as file:
    reader = csv.reader(file)
    next(reader)
    for row in reader:
        number.append(int(row[0]))
        self_oriented.append(float(row[1]))
        other_oriented.append(float(row[2]))
        socially_prescribed.append(float(row[3]))
        perf_overall.append(float(row[4]))
        neg_past.append(float(row[5]))
        pos_past.append(float(row[6]))
        fat_pres.append(float(row[7]))
        hed_pres.append(float(row[8]))
        future.append(float(row[9]))

# По индексу в каждом списке можно найти результаты конкретного испытуемого.

i = 0
while i < len(number):
    with open(f"feadback_{number[i]}.txt","w",encoding="utf8") as f:
        print("""Доброго времени суток! Вы участвовали в научном исследовании, посвященном перфекционизму. Этот файл содержит обратную связь: названия использованных методик, результаты в баллах и их интерпретацию. Спасибо за участие!""",file=f)
        print("",file=f)

        print("Первая методика: Многомерная шкала перфекционизма Хьюита-Флита ", file=f)

        print(f"Шкала 1: Я-ориентированный перфекционизм. Ваш балл: {self_oriented[i]}", file=f)
        if self_oriented[i] < 49:
            print("""Это соответствует низкому уровню. Вам не свойственно предъявлять к себе завышенные требования и стремиться их реализовать любой ценой.""",file=f)
        elif self_oriented[i] > 83:
            print("""Это соответствует высокому уровню. Вы во всех сферах жизни предъявляете завышенные требования к себе и стремитесь их воплотить.""",file=f)
        else:
            print("""Это соответствует среднему уровню. В некоторых сферах жизни Вы предъявляете к себе завышенные требования, которые стремитесь воплотить.""",file=f)

        print(f"Шкала 2: Перфекционизм, ориентированный на других. Ваш балл: {other_oriented[i]}", file=f)
        if other_oriented[i] < 43:
            print("""Это соответствует низкому уровню. Вы не предъявляете чрезвычайно высокие требования к окружающим людям.""",file=f)
        elif other_oriented[i] > 68:
            print("""Это соответствует высокому уровню. Вы зачастую предъявляете чрезвычайно высокие требования к окружающим людям.""",file=f)
        else:
            print("""Это соответствует среднему уровню. Вы иногда предъявляете чрезвычайно высокие требования к окружающим людям.""",file=f)

        print(f"Шкала 3: Социально предписываемый перфекционизм. Ваш балл: {socially_prescribed[i]}", file=f)
        if socially_prescribed[i] < 35:
            print("""Это соответствует низкому уровню. Вы не расцениваете требования, предъявляемые к Вам окружающими, как завышенные и нереалистичные.""",file=f)
        elif socially_prescribed[i] > 65:
            print("""Это соответствует высокому уровню. Вы расцениваете требования, предъявляемые к Вам окружающими, как завышенные и нереалистичные.""",file=f)
        else:
            print("""Это соответствует среднему уровню. Вы периодически расцениваете требования, предъявляемые к Вам окружающими, как завышенные и нереалистичные.""",file=f)

        print(f"Общий уровень перфекционизма. Ваш балл: {perf_overall[i]}", file=f)
        if perf_overall[i] < 160:
            print("Это соответствует низкому уровню выраженности перфекционизма.",file=f)
        elif perf_overall[i] > 204:
            print("Это соответствует высокому уровню выраженности перфекционизма.",file=f)
        else:
            print("Это соответствует среднему уровню выраженности перфекционизма.",file=f)

        print("",file=f)
        print("Вторая методика: Опросник временной перспективы Зимбардо.", file=f)

        print(f"Шкала 1: Негативное прошлое. Ваш балл: {neg_past[i]}", file=f)
        if neg_past[i] < 2.55:
            print("""Это соответствует низкому уровню. Вы не относитесь к своему прошлому пессимистично, для Вас прошлое не является травматичным или неприятным.""",file=f)
        elif neg_past[i] > 3.62:
            print("""Это соответствует высокому уровню. Вы относитесь к своему прошлому пессимистично, воспринимаете его в значительной степени как травматичное и неприятное. Также Вы часто сожалеете о поступках, совершенных Вами в прошлом.""",file=f)
        else:
            print("""Это соответствует среднему уровню. Вы отчасти относитесь к своему прошлому пессимистично, некоторые произошедшие с Вами события Вы воспринимаете как травматические и неприятные. Также Вы иногда склонны сожалеть о поступках, совершенных Вами в прошлом.""",file=f)

        print(f"Шкала 2: Позитивное прошлое. Ваш балл: {pos_past[i]}", file=f)
        if pos_past[i] < 3.1:
            print("""Это соответствует низкому уровню. Вы не склонны воспринимать свое прошлое как теплое, не относитесь к нему с сентиментальностью. Вы редко обращаетесь к светлым моментам прошлого, так как воспоминания о них слабо поддерживают Вас в трудную минуту.""",file=f)
        elif pos_past[i] > 3.88:
            print("""Это соответствует высокому уровню. Вам свойственно теплое, сентиментальное отношение к прошлому. Для Вас прошлое - то, к чему очень приятно обращаться, ведь в нем хранится много приятных и светлых моментов, которые поддерживают Вас в трудную минуту.""",file=f)
        else:
            print("""Это соответствует среднему уровню. К некоторым событиям в своем прошлом Вы имеете теплое, сентиментальное отношение. Вы иногда обращаетесь к приятным и светлым моментам, воспоминания о которых поддерживают Вас в трудную минуту.""",file=f)

        print(f"Шкала 3: Фаталистическое настоящее. Ваш балл: {fat_pres[i]}", file=f)
        if fat_pres[i] < 2.39:
            print("""Это соответствует низкому уровню. Вы не считаете, что будущее предопределено и что Вы никак не можете на него повлиять. Вы часто предпринимаете шаги, действуете, ведь убеждены, что именно Ваши поступки определяют Вашу судьбу.""",file=f)
        elif fat_pres[i] > 3.25:
            print("""Это соответствует высокому уровню. Вы часто чувствуете, что не способны повлиять на то, что происходит с Вами в настоящем. Вам кажется, что будущее предопределено и Вы никак не можете на него повлиять.""",file=f)
        else:
            print("""Это соответствует среднему уровню. Иногда Вы чувствуете, что не способны повлиять на то, что происходит с Вами в настоящем. Периодически Вам кажется, что будущее предопределено и Вы никак не можете на него повлиять. Однако все же Вы действуете, когда считаете это возможным.""",file=f)

        print(f"Шкала 4: Гедонистическое настоящее. Ваш балл: {hed_pres[i]}", file=f)
        if hed_pres[i] < 3.1:
            print("""Это соответствует низкому уровню. Вы не склонны ориентироваться на удовольствие и наслаждение, которое можете получить от нахождения в настоящем. Вам не нравится рисковать, поскольку не считаете, что яркие впечатления от риска стоят того. """,file=f)
        elif hed_pres[i] > 3.63:
            print("""Это соответствует высокому уровню. В настоящем Вы часто ориентируетесь на получение удовольствия и наслаждения. Вам нравится рисковать, ведь риск приносит Вам яркие впечатления. Также в моменте Вы склонны игнорировать будущие последствия. """,file=f)
        else:
            print("""Это соответствует среднему уровню. Вы периодически ориентируетесь на получение удовольствия и наслаждения. Иногда Вам нравится рисковать, так как риск может приносить яркие впечатления. Бывают случаи, когда это приводит к игнорированию будущих последствий.""",file=f)

        print(f"Шкала 5: Будущее. Ваш балл: {future[i]}", file=f)
        if future[i] < 3.3:
            print("""Это соответствует низкому уровню. Ваше поведение редко определяется стремлениями к целям и вознаграждениям будущего. Вы не склонны планировать свою деятельность, часто она протекает импульсивно под влиянием того, что требуется в данный момент времени.""",file=f)
        elif future[i] > 3.86:
            print("""Это соответствует высокому уровню. Ваше поведение в большей степени определяется стремлениями к целям и вознаграждениям будущего. Вы умеете планировать свою деятельность и жертвовать чем-то в моменте для достижения цели в будущем. Также Вы часто ощущаете “давление времени” в текущей жизни.""",file=f)
        else:
            print("""Это соответствует среднему уровню. Ваше поведение периодически определяется стремлениями к целям и вознаграждениям будущего. Вы склонны планировать свою деятельность и способны иногда жертвовать чем-то в моменте для достижения цели в будущем.  """,file=f)
    i += 1